container/book_collection/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Howdy"], ["created_at", "2024-02-16 06:46:32.163046"], ["updated_at", "2024-02-16 06:46:32.163046"], ["author", "Garrett"], ["price", "10.0"], ["published_date", "2024-02-13"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save